In [1]:
import pandas as pd

df = pd.read_csv("ch02-data.csv")
print(df)

          day  ammount
0  2013-01-24      323
1  2013-01-25      233
2  2013-01-26      433
3  2013-01-27      555
4  2013-01-28      123
5  2013-01-29        0
6  2013-01-30      221

In [ ]:
from pymongo import MongoClient

client = MongoClient()
collection = client["douban"]["tv1"]
data = list(collection.find())
print(data)

In [3]:
import string
import numpy as np
t = pd.Series(np.arange(10),index=list(string.ascii_uppercase[:10]))
t

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int32

In [4]:
type(t)

pandas.core.series.Series

In [5]:
t = pd.Series([1,2,4,6,21,13,5])
t

0     1
1     2
2     4
3     6
4    21
5    13
6     5
dtype: int64

In [10]:
df = pd.DataFrame(np.arange(12).reshape(3,4))
df

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [71]:
t1 = pd.DataFrame(np.arange(12).reshape(3,4),index=list("abc"),columns=list("wxyz"))
t1

   w  x   y   z
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

### loc的使用

In [14]:
t1.loc["a","z"]

3

In [15]:
type(t1.loc["a","z"])

numpy.int32

In [16]:
t1.loc["a"]

w    0
x    1
y    2
z    3
Name: a, dtype: int32

In [19]:
t1.loc[:,"w"]

a    0
b    4
c    8
Name: w, dtype: int32

In [21]:
t1.loc[["a","c"]]

   w  x   y   z
a  0  1   2   3
c  8  9  10  11

In [23]:
t1.loc[:,["w","z"]]

   w   z
a  0   3
b  4   7
c  8  11

### iloc的使用

In [28]:
t1.iloc[1]

w    4
x    5
y    6
z    7
Name: b, dtype: int32

In [29]:
t1.iloc[:,2]

a     2
b     6
c    10
Name: y, dtype: int32

In [30]:
t1.iloc[:,[2,1]]

    y  x
a   2  1
b   6  5
c  10  9

In [31]:
print(t1.head(2))

   w  x  y  z
a  0  1  2  3
b  4  5  6  7

In [32]:
print(t1.tail(2))

   w  x   y   z
b  4  5   6   7
c  8  9  10  11

In [33]:
print(t1.info())

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to c
Data columns (total 4 columns):
w    3 non-null int32
x    3 non-null int32
y    3 non-null int32
z    3 non-null int32
dtypes: int32(4)
memory usage: 152.0+ bytes
None

In [35]:
print(t1.describe())

         w    x     y     z
count  3.0  3.0   3.0   3.0
mean   4.0  5.0   6.0   7.0
std    4.0  4.0   4.0   4.0
min    0.0  1.0   2.0   3.0
25%    2.0  3.0   4.0   5.0
50%    4.0  5.0   6.0   7.0
75%    6.0  7.0   8.0   9.0
max    8.0  9.0  10.0  11.0

### 降序排列

In [36]:
t = t1.sort_values(by="z",ascending=False)
print(t)

   w  x   y   z
c  8  9  10  11
b  4  5   6   7
a  0  1   2   3

In [47]:
pd.isnull(t)

       w      x      y      z
c  False  False  False  False
b  False  False  False  False
a  False  False  False  False

In [38]:
t1

   w  x   y   z
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [73]:
t1.iloc[1,2]=np.nan
t = t1
t1

   w  x     y   z
a  0  1   2.0   3
b  4  5   NaN   7
c  8  9  10.0  11

In [48]:
pd.isnull(t1)

       w      x      y      z
a  False  False  False  False
b  False  False   True  False
c  False  False  False  False

In [49]:
pd.notnull(t1)

      w     x      y     z
a  True  True   True  True
b  True  True  False  True
c  True  True   True  True

In [53]:
t1[pd.notnull(t1["y"])]

   w  x     y   z
a  0  1   2.0   3
c  8  9  10.0  11

In [55]:
t1.dropna(axis=0)

   w  x     y   z
a  0  1   2.0   3
c  8  9  10.0  11

In [57]:
# 行全为NaN
t1.dropna(axis=0,how="all")

   w  x     y   z
a  0  1   2.0   3
b  4  5   NaN   7
c  8  9  10.0  11

In [58]:
# 行部分为NaN
t1.dropna(axis=0,how="any")

   w  x     y   z
a  0  1   2.0   3
c  8  9  10.0  11

In [68]:
t1.dropna(axis=0,how="any",inplace=True)
t1

   w  x     y   z
a  0  1   2.0   3
c  8  9  10.0  11

In [76]:
t1.mean()

w    4.0
x    5.0
y    6.0
z    7.0
dtype: float64

In [75]:
t1.fillna(t1.mean())

   w  x     y   z
a  0  1   2.0   3
b  4  5   6.0   7
c  8  9  10.0  11

In [84]:
t1.iloc[1,2]=np.nan
t1

   w  x     y   z
a  0  1   2.0   3
b  4  5   NaN   7
c  8  9  10.0  11

In [88]:
t1.fillna(t1.mean())

   w  x     y   z
a  0  1   2.0   3
b  4  5   6.0   7
c  8  9  10.0  11